[net]
policy=steps
batch=64
max_batches=500200
momentum=0.9
steps=325130, 425170
channels=3
subdivisions=16
decay=0.0005
learning_rate=0.001
hue=0.1
saturation=1.5
angle=0
burn_in=1000
exposure=1.5
width=512
scales=.1, .1,
height=512

[convolutional]
stride=1
filters=16
activation=relu
size=7
batch_normalize=1
pad=1
padding=3

[convolutional]
stride=1
filters=16
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=2
filters=32
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[maxpool]
size=2
stride=2
padding=0

[convolutional]
stride=1
filters=64
activation=linear
size=1
batch_normalize=1
pad=1
padding=0

[route]
layers=-3

[convolutional]
stride=2
filters=64
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=64
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-4
activation=relu

[convolutional]
stride=1
filters=64
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=64
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4

[convolutional]
stride=1
filters=64
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[maxpool]
size=2
stride=2
padding=0

[route]
layers=-2

[maxpool]
size=2
stride=2
padding=0

[convolutional]
stride=1
filters=128
activation=linear
size=1
batch_normalize=1
pad=1
padding=0

[route]
layers=-5

[convolutional]
stride=2
filters=128
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=128
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-4
activation=relu

[convolutional]
stride=1
filters=128
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=128
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4

[convolutional]
stride=1
filters=128
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[convolutional]
stride=1
filters=128
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=128
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[convolutional]
stride=1
filters=128
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=128
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4,-19,-7

[convolutional]
stride=1
filters=128
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[maxpool]
size=2
stride=2
padding=0

[route]
layers=-2

[maxpool]
size=2
stride=2
padding=0

[convolutional]
stride=1
filters=256
activation=linear
size=1
batch_normalize=1
pad=1
padding=0

[route]
layers=-5

[convolutional]
stride=2
filters=256
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=256
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-4
activation=relu

[convolutional]
stride=1
filters=256
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=256
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4

[convolutional]
stride=1
filters=256
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[convolutional]
stride=1
filters=256
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=256
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[convolutional]
stride=1
filters=256
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=256
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4,-19,-7

[convolutional]
stride=1
filters=256
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[maxpool]
size=2
stride=2
padding=0

[convolutional]
stride=1
filters=512
activation=linear
size=1
batch_normalize=1
pad=1
padding=0

[route]
layers=-3

[convolutional]
stride=2
filters=512
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=512
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-4
activation=relu

[convolutional]
stride=1
filters=512
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
stride=1
filters=512
activation=linear
size=3
batch_normalize=1
pad=1
padding=1

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4,-9

[convolutional]
stride=1
filters=512
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[convolutional]
stride=1
filters=256
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[upsample]
stride=2

[route]
layers=-14,-1

[convolutional]
stride=1
filters=256
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[route]
layers=-16

[convolutional]
stride=1
filters=128
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[upsample]
stride=2

[route]
layers=-4

[convolutional]
stride=1
filters=128
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[upsample]
stride=2

[route]
layers=-43,-4

[convolutional]
stride=1
filters=128
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[route]
layers=-1,-3

[convolutional]
stride=1
filters=128
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[route]
layers=-47

[convolutional]
stride=1
filters=64
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[upsample]
stride=2

[route]
layers=-6

[convolutional]
stride=1
filters=64
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[upsample]
stride=2

[route]
layers=-7

[convolutional]
stride=1
filters=64
activation=relu
size=1
batch_normalize=1
pad=1
padding=0

[upsample]
stride=2

[route]
layers=-77,-7

[convolutional]
stride=1
filters=64
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[route]
layers=-1,-6

[convolutional]
stride=1
filters=64
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[route]
layers=-1,-5

[convolutional]
stride=1
filters=64
activation=relu
size=3
batch_normalize=1
pad=1
padding=1

[convolutional]
size=3
stride=1
activation=relu
batch_normalize=0
filters=256
pad=1
padding=1

[convolutional]
size=1
stride=1
activation=linear
batch_normalize=0
filters=2
pad=1
padding=0

[route]
layers=-3

[convolutional]
size=3
stride=1
activation=relu
batch_normalize=0
filters=256
pad=1
padding=1

[convolutional]
size=1
stride=1
activation=linear
batch_normalize=0
filters=2
pad=1
padding=0

[route]
layers=-6

[convolutional]
size=3
stride=1
activation=relu
batch_normalize=0
filters=256
pad=1
padding=1

[convolutional]
size=1
stride=1
activation=linear
batch_normalize=0
filters=80
pad=1
padding=0

[route]
layers=-1,-4,-7

[ctdet]
size=3
stride=1
wh=0.1
classes=80
off=1.0
jitter=0.3
hm=1.0

