[net]
steps=325130, 425170
height=512
batch=64
saturation=1.5
channels=3
decay=0.0005
learning_rate=0.001
scales=.1, .1,
momentum=0.9
width=512
angle=0
burn_in=1000
hue=0.1
exposure=1.5
subdivisions=16
policy=steps
max_batches=500200

[convolutional]
size=7
pad=1
batch_normalize=1
stride=1
padding=3
activation=relu
filters=16

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=16

[convolutional]
size=3
pad=1
batch_normalize=1
stride=2
padding=1
activation=relu
filters=32

[maxpool]
stride=2
padding=0
size=2

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=linear
filters=64

[route]
layers=-3

[convolutional]
size=3
pad=1
batch_normalize=1
stride=2
padding=1
activation=relu
filters=64

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=64

[shortcut]
from=-4
activation=relu

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=64

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=64

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=64

[maxpool]
stride=2
padding=0
size=2

[route]
layers=-2

[maxpool]
stride=2
padding=0
size=2

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=linear
filters=128

[route]
layers=-5

[convolutional]
size=3
pad=1
batch_normalize=1
stride=2
padding=1
activation=relu
filters=128

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=128

[shortcut]
from=-4
activation=relu

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=128

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=128

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=128

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=128

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=128

[shortcut]
from=-3
activation=relu

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=128

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=128

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4,-19,-7

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=128

[maxpool]
stride=2
padding=0
size=2

[route]
layers=-2

[maxpool]
stride=2
padding=0
size=2

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=linear
filters=256

[route]
layers=-5

[convolutional]
size=3
pad=1
batch_normalize=1
stride=2
padding=1
activation=relu
filters=256

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=256

[shortcut]
from=-4
activation=relu

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=256

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=256

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=256

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=256

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=256

[shortcut]
from=-3
activation=relu

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=256

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=256

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4,-19,-7

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=256

[maxpool]
stride=2
padding=0
size=2

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=linear
filters=512

[route]
layers=-3

[convolutional]
size=3
pad=1
batch_normalize=1
stride=2
padding=1
activation=relu
filters=512

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=512

[shortcut]
from=-4
activation=relu

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=512

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=linear
filters=512

[shortcut]
from=-3
activation=relu

[route]
layers=-1,-4,-9

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=512

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=256

[upsample]
stride=2

[route]
layers=-14,-1

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=256

[route]
layers=-16

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=128

[upsample]
stride=2

[route]
layers=-4

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=128

[upsample]
stride=2

[route]
layers=-43,-4

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=128

[route]
layers=-1,-3

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=128

[route]
layers=-47

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=64

[upsample]
stride=2

[route]
layers=-6

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=64

[upsample]
stride=2

[route]
layers=-7

[convolutional]
size=1
pad=1
batch_normalize=1
stride=1
padding=0
activation=relu
filters=64

[upsample]
stride=2

[route]
layers=-77,-7

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=64

[route]
layers=-1,-6

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=64

[route]
layers=-1,-5

[convolutional]
size=3
pad=1
batch_normalize=1
stride=1
padding=1
activation=relu
filters=64

[convolutional]
activation=relu
stride=1
padding=1
pad=1
batch_normalize=0
filters=256
size=3

[convolutional]
activation=linear
stride=1
padding=0
pad=1
batch_normalize=0
filters=2
size=1

[route]
layers=-3

[convolutional]
activation=relu
stride=1
padding=1
pad=1
batch_normalize=0
filters=256
size=3

[convolutional]
activation=linear
stride=1
padding=0
pad=1
batch_normalize=0
filters=2
size=1

[route]
layers=-6

[convolutional]
activation=relu
stride=1
padding=1
pad=1
batch_normalize=0
filters=256
size=3

[convolutional]
activation=linear
stride=1
padding=0
pad=1
batch_normalize=0
filters=80
size=1

[route]
layers=-1,-4,-7

[ctdet]
classes=80
jitter=0.3
stride=1
size=3
off=1.0
padding=0
hm=1.0
wh=0.1

